const wuxingju=[
    [0, 4, 3, 1, 2],
    [4, 3, 1, 2, 0],
    [1, 2, 0, 4, 3],
    [3, 1, 2, 0, 4],
    [2, 0, 4, 3, 1],
    [4, 3, 1, 2, 0]
];
const wuxingju_str=["水二局", "木三局", "金四局", "土五局", "火六局"];
const gongwei=["父母", "福德", "田宅", "官禄", "交友", "迁移", "疾厄", "财帛", "子女", "夫妻", "兄弟"]
const ziweixing=[
    [1, 4, 11, 6, 9], 
    [2, 1, 4, 11, 6], 
    [2, 2, 1, 4, 11], 
    [3, 5, 2, 1, 4], 
    [3, 2, 0, 2, 1], 
    [4, 3, 5, 7, 2], 
    [4, 6, 2, 0, 10], 
    [5, 3, 3, 5, 7], 
    [5, 4, 1, 2, 0], 
    [6, 7, 7, 3, 5], 
    [6, 4, 3, 8, 2], 
    [7, 5, 4, 1, 3], 
    [7, 8, 2, 6, 11],
    [8, 5, 7, 3, 8], 
    [8, 6, 4, 4, 1], 
    [9, 9, 5, 9, 6], 
    [9, 6, 3, 2, 3], 
    [10, 7, 8, 7, 4],
    [10, 10, 5, 4, 0], 
    [11, 7, 6, 5, 9], 
    [11, 8, 4, 10, 2], 
    [0, 11, 9, 3, 7], 
    [0, 8, 6, 8, 4], 
    [1, 9, 7, 5, 5], 
    [1, 0, 5, 6, 1], 
    [2, 9, 10, 11, 10], 
    [2, 10, 7, 4, 3], 
    [3, 1, 8, 9, 8], 
    [3, 10, 6, 6, 5], 
    [4, 11, 11, 7, 6]
];

const yeargan_zhuxing=[
    [2, 3, 1, 1, 7, 7, 9, 5, 8, 9], 
    [3, 4, 2, 0, 8, 4, 8, 6, 6, 7], 
    [5, 6, 4, 11, 9, 5, 0, 0, 4, 5], 
    [6, 7, 5, 11, 9, 2, 11, 5, 2, 3], 
    [5, 6, 4, 1, 7, 3, 3, 6, 0, 1], 
    [6, 7, 5, 0, 8, 9, 2, 8, 8, 9], 
    [8, 9, 7, 1, 7, 11, 6, 2, 6, 7], 
    [9, 10, 8, 2, 6, 9, 5, 6, 4, 5], 
    [11, 0, 10, 3, 5, 10, 6, 9, 2, 3], 
    [0, 1, 11, 3, 5, 6, 5, 11, 0, 1]
]
const yearzhi_zhuxing=[
    [2, 1, 6, 6, 4, 10, 3, 9, 2, 10, 8, 5, 4, 9, 9, 5], 
    [11, 2, 5, 7, 5, 9, 2, 8, 2, 10, 9, 1, 1, 6, 10, 6], 
    [8, 3, 4, 8, 6, 8, 1, 7, 5, 1, 10, 9, 10, 3, 11, 7], 
    [5, 4, 3, 9, 7, 7, 0, 6, 5, 1, 5, 5, 7, 0, 0, 8], 
    [2, 5, 2, 10, 8, 6, 11, 5, 5, 1, 6, 1, 4, 9, 1, 9], 
    [11, 6, 1, 11, 9, 5, 10, 4, 8, 4, 7, 9, 1, 6, 2, 10], 
    [8, 7, 0, 0, 10, 4, 9, 3, 8, 4, 2, 5, 10, 3, 3, 11], 
    [5, 8, 11, 1, 11, 3, 8, 2, 8, 4, 3, 1, 7, 0, 4, 0], 
    [2, 9, 10, 2, 0, 2, 7, 1, 11, 7, 4, 9, 4, 9, 5, 1], 
    [11, 10, 9, 3, 1, 1, 6, 0, 11, 7, 11, 5, 1, 6, 6, 2], 
    [8, 11, 8, 4, 2, 0, 5, 11, 11, 7, 0, 1, 10, 3, 7, 3], 
    [5, 0, 7, 5, 3, 11, 4, 10, 2, 10, 1, 9, 7, 0, 8, 4]
]
const monthgan_zhuxing=[
    [4, 10, 9, 1, 8, 5, 10, 2], 
    [5, 9, 10, 2, 8, 8, 5, 0], 
    [6, 8, 11, 3, 10, 2, 4, 10], 
    [7, 7, 0, 4, 10, 11, 2, 8], 
    [8, 6, 1, 5, 0, 5, 7, 6], 
    [9, 5, 2, 6, 0, 8, 3, 4], 
    [10, 4, 3, 7, 2, 2, 11, 2], 
    [11, 3, 4, 8, 2, 11, 7, 0], 
    [0, 2, 5, 9, 4, 5, 2, 10], 
    [1, 1, 6, 10, 4, 8, 6, 8], 
    [2, 0, 7, 11, 6, 2, 10, 6], 
    [3, 11, 8, 0, 6, 11, 2, 4]
]

const monthzhi_zhuxing=[
    [10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0, 11], 
    [4, 5, 6, 7, 8, 9, 10, 11, 0, 1, 2, 3], 
    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 0], 
    [3, 4, 5, 6, 7, 8, 9, 10, 11, 0, 1, 2], 
    [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 0, 1], 
    [10, 11, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9], 
    [3, 4, 5, 6, 7, 8, 9, 10, 11, 0, 1, 2], 
    [10, 11, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9], 
    [9, 10, 11, 0, 1, 2, 3, 4, 5, 6, 7, 8], 
    [10, 11, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9], 
    [11, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10], 
    [11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0], 
    [6, 7, 8, 9, 10, 11, 0, 1, 2, 3, 4, 5], 
    [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 0, 1]
]

const hua_list = [
    [5,13,3,2],
    [1,11,0,7],
    [4,1,50,5],
    [7,4,1,9],
    [8,7,43,1],
    [3,8,11,51],
    [2,3,7,4],
    [9,2,51,50],
    [11,0,42,3],
    [13,9,7,8]
]

const tw_shen = [
    [8, 7, 6, 5, 4, 3, 2, 1, 0, 11, 10, 9], 
    [8, 9, 10, 11, 0, 1, 2, 3, 4, 5, 6, 7], 
    [11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0], 
    [11, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10], 
    [5, 4, 3, 2, 1, 0, 11, 10, 9, 8, 7, 6], 
    [5, 6, 7, 8, 9, 10, 11, 0, 1, 2, 3, 4], 
    [8, 7, 6, 5, 4, 3, 2, 1, 0, 11, 10, 9], 
    [8, 9, 10, 11, 0, 1, 2, 3, 4, 5, 6, 7], 
    [2, 1, 0, 11, 10, 9, 8, 7, 6, 5, 4, 3],
    [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 0, 1]
]

const xy_list = [
    [4,0,1,1,2,1,0,0,1,1,2,1],
    [0,6,2,1,3,4,0,6,2,1,3,4],
    [6,5,1,0,1,1,1,2,2,4,5,6],
    [1,0,2,3,0,4,1,0,2,3,0,4],
    [1,5,3,4,4,0,6,5,1,4,4,0],
    [4,3,0,4,3,6,4,3,0,4,3,6],
    [0,0,0,2,0,2,1,0,2,1,0,2],
    [0,0,1,6,6,6,5,5,3,1,1,0],
    [1,0,4,3,0,6,1,0,4,3,0,6],
    [1,5,0,0,6,1,1,5,0,0,6,1],
    [0,0,0,6,2,2,0,2,0,6,2,2],
    [0,1,0,0,0,6,0,1,6,2,0,6],
    [1,0,0,1,0,4,1,0,0,1,0,4],
    [0,1,2,6,1,4,0,1,2,6,1,4],
    [0,"*",0,0,"*",0,0,"*",0,0,"*",0],
    [6,0,"*",6,0,"*",6,0,"*",6,0,"*"],
    ["*",0,6,"*",0,6,"*",0,6,"*",0,6],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [2,0,6,3,2,0,6,3,2,0,6,3],
    [2,0,4,1,2,0,6,1,2,0,6,1],
    [6,2,0,3,6,2,0,3,6,2,0,3],
    [6,2,0,3,6,2,0,3,6,2,0,3]
]

const xing = [
    ["紫微","天机","太阳","武曲","天同","廉贞","天府","太阴","贪狼","巨门","天相","天梁","七杀","破军","禄存","擎羊","陀罗","天魁","天钺","天官","天福","天厨","截路","空亡","天马","天空","天哭","天虚","龙池","凤阁","红鸾","天喜","孤辰","寡宿","蜚廉","破碎","华盖","咸池","天德","月德","天才","天寿","左辅","右弼","天刑","天姚","解神","天巫","天月","阴煞","文昌","文曲","火星","铃星","地劫","地空","台辅","封诰","三台","八座","恩光","天贵","天伤","天使","长生","沐浴","冠带","临官","帝旺","衰","病","死","墓","绝","胎","养","博士","力士","青龙","小耗","将军","奏书","飞廉","喜神","病符","大耗","伏兵","宫符","岁建","晦气","丧门","贯索","官符","小耗","大耗","龙德","白虎","天德","吊客","病符","将星","攀鞍","岁驿","息神","华盖","劫煞","灾煞","天煞","指背","咸池","月煞","亡神"],
    ['大', '大', '大', '大', '大', '大', '大', '大', '大', '大', '大', '大', '大', '大', '甲', '忌', '忌', '甲', '甲', '乙', '乙', '乙', '丙', '丙', '甲', '乙', '乙', '乙', '乙', '乙', '乙', '乙', '乙', '乙', '乙', '乙', '乙', '乙', '乙', '乙', '乙', '乙', '乙', '甲', '甲', '乙', '乙', '乙', '乙', '乙', '乙', '甲', '忌', '忌', '忌', '忌', '甲', '乙', '乙', '乙', '乙', '乙', '乙', '丙', '丙', '丙', '丙', '丙', '丙', '丙', '丙', '丙', '丙', '丙', '丙', '丙', '丙', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '丁', '戊', '戊', '戊', '戊', '戊', '戊', '丁', '戊', '丁', '戊', '戊', '丁', '丁', '丁', '戊', '丁', '戊', '戊', '戊', '戊', '戊', '戊', '戊']
]

const hua = ["禄","权","科","忌"];
const yy=["阴","阳"];
const sx=["女","男"];
const jybd=["甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"];
const zcym=['子', '丑', '寅', '卯', '辰', '巳', '午', '未', '申', '酉', '戌', '亥'];
const wh_a=['戊','丁','丙','乙','甲','癸','壬','辛','庚','己'];
const wh_b=['甲','壬','庚','戊','丙'];
const ws_b=['甲','丙','戊','庚','壬'];
const xy=['庙','旺','得','利','平','不','陷'];

        function paipan(inputYear,inputMonth,inputDay,inputTime,inputSex) {

            let pan={};
            pan.wholeYearMg=[];
            
            pan.nongli=calendar.solar2lunar(inputYear, inputMonth, inputDay);//调用nlgl.js的函数拿到object
            
            pan.yysex=((pan.nongli.lYear-1)%2)==0?-1:1;
            pan.sex=inputSex==1?1:0;
            pan.clock=pan.yysex*(pan.sex==1?1:-1);
            pan.clock=pan.clock==1?1:-1;
  
            pan.yearst_tg=jybd.indexOf(pan.nongli.gzYear[0]);//从jybd数组里找，字符转成数字
            pan.yearst_dz=zcym.indexOf(pan.nongli.gzYear[1]);//在zcym里找转
            //年柱↑
            pan.monst_tg=jybd.indexOf(wh_b[wh_a.indexOf(pan.nongli.gzYear[0])%5]);//wha数组的格式是五个为一行，所以%5取余
            pan.monst_dz=2;//一月地支默认为寅
            pan.fstmon_tg=pan.monst_tg;//保存一月天干
            
            for(let i=2;i<pan.nongli.lMonth+1;i++){
                pan.monst_tg=(pan.monst_tg+1)%10;
                pan.monst_dz=(pan.monst_dz+1)%12;
            }
            let j=pan.fstmon_tg;
            pan.wholeYearMg.push(j);
            for(let i=0;i<11;i++){
                j=(j+1)%10;
                pan.wholeYearMg.push(j);
            }
            //月柱↑
            pan.day_tg=((inputYear-1911-10)*5+Math.floor((inputYear-1911-10)/4)+daysBetweenDates(inputYear, inputMonth, inputDay))+1%60;
            pan.day_dz=pan.day_tg%12-1;
            pan.day_tg=pan.day_tg%10-1;
            pan.day_tg=(pan.day_tg+9)%9;
            pan.day_dz=(pan.day_dz+11)%11;
            //日柱↑
            pan.time_tg=jybd.indexOf(ws_b[pan.day_tg%5]);
            pan.timeed_tg=Math.floor(inputTime/2)%12;            
            pan.time_dz=Math.floor((+inputTime+1)/2)%12;
            

            for(let i=0;i<pan.timeed_tg;i++){
                pan.time_tg=(pan.time_tg+1)%10;
            }
            //时柱↑

            pan.minggong=(11-(pan.time_dz+9)%12+pan.nongli.lMonth-1)%12;
            pan.shengong=((pan.time_dz+2)%12+pan.nongli.lMonth-1)%12;
            //命宫身宫↑
            pan.wuxing_ju=wuxingju[Math.floor(pan.minggong/2)][pan.yearst_tg%5];//五行局算法

            pan.xing=new Array(116);
            pan.xing[0]=ziweixing[pan.nongli.lDay-1][pan.wuxing_ju];
            //紫微星↑
            for(let i=0,j=[11,9,8,7,4];i<5;i++){
                pan.xing[i+1]=(pan.xing[0]+j[i])%12;
            }
            //天机太阳武曲天同廉贞↑
            pan.xing[6]=zcym.indexOf(zcym.slice().reverse()[(pan.xing[0]+7)%12]);
            //天府星↑
            for(let i=0,j=[1,2,3,4,5,6,10];i<7;i++){
                pan.xing[7+i]=(pan.xing[6]+j[i])%12;
            }
            //天府诸星↑
            for(let i=0;i<10;i++){
                pan.xing[14+i]=yeargan_zhuxing[pan.yearst_tg][i];
            }
            //年干系诸星上↑
            for(let i=0;i<16;i++){
                pan.xing[24+i]=yearzhi_zhuxing[pan.yearst_dz][i];
            }
            pan.xing[40]=(pan.minggong+pan.yearst_dz)%12;
            pan.xing[41]=(pan.shengong+pan.yearst_dz)%12;
            //年支系诸星上↑
            for(let i=0;i<8;i++){
                pan.xing[42+i]=monthgan_zhuxing[pan.nongli.lMonth-1][i];
            }
            //月干系诸星上↑
            pan.xing[50]=monthzhi_zhuxing[0][pan.time_dz];
            pan.xing[51]=monthzhi_zhuxing[1][pan.time_dz];

            switch(pan.yearst_dz%4){
                case 0:
                    pan.xing[52]=(pan.time_dz+2)%12;
                    pan.xing[53]=(pan.time_dz+10)%12;
                    break;
                case 1:
                    pan.xing[52]=(pan.time_dz+3)%12;
                    pan.xing[53]=(pan.time_dz+10)%12;
                    break;
                case 2:
                    pan.xing[52]=(pan.time_dz+1)%12;
                    pan.xing[53]=(pan.time_dz+3)%12;
                    break;
                case 3:
                    pan.xing[52]=(pan.time_dz+9)%12;
                    pan.xing[53]=(pan.time_dz+10)%12;
                    break;
            }
            pan.xing[54]=(pan.time_dz+11)%12;
            pan.xing[55]=11-pan.time_dz;
            pan.xing[56]=(pan.time_dz+6)%12;
            pan.xing[57]=(pan.time_dz+2)%12;

            pan.xing[58]=(pan.xing[42]+pan.nongli.lDay-1)%12;
            pan.xing[59]=(((pan.xing[43]-(pan.nongli.lDay-1))%12)+12)%12;
            pan.xing[60]=(pan.xing[50]+pan.nongli.lDay-2)%12;
            pan.xing[61]=(pan.xing[51]+pan.nongli.lDay-2)%12;

            pan.hua=new Array(4);
            for(let i=0;i<4;i++){
                pan.hua[i]=pan.xing[hua_list[pan.yearst_tg][i]];
            }
            
            pan.xing[62]=(pan.minggong+5)%12
            pan.xing[63]=(pan.minggong+7)%12


            for(let i=0;i<12;i++){
                pan.xing[64+i]=tw_shen[pan.wuxing_ju*2+(pan.clock==1?1:0)][i]
            }
            
            for(let i=0;i<12;i++){
                pan.xing[76+i]=(((pan.xing[14]+i*(pan.clock==1?1:-1))%12)+12)%12;
            }
            
            pan.daxian=new Array(12);
            for(let i=0;i<12;i++){
                pan.daxian[i]=(((2+pan.wuxing_ju+i*10*pan.clock)%120)+120)%120;
            }
            
            for(let i=0;i<12;i++){
                pan.xing[88+i]=(pan.yearst_dz+i)%12;
            }

            // for(let i=0,j=[8,0,4,11,3,7,2,6,10,5,9,1];i<12;i++){
            //     pan.xing[100+i]=((j.indexOf(pan.yearst_dz))%3*3+i)%12;
            //     console.log();
            // }

            pan.xingyao=new Array(116);
            for(let i=0;i<=16;i++){
                pan.xingyao[i]=xy_list[i][pan.xing[i]];
            }
            for(let i=0;i<=3;i++){
                pan.xingyao[50+i]=xy_list[50+i][pan.xing[50+i]];
            }

            return pan;
            
        }

        function daysBetweenDates(inputYear, inputMonth, inputDay) {
            // 创建起始日期为当年的1月1日
            const startDate = new Date(inputYear, 0, 1); // 注意月份从0开始计数
            // 创建结束日期为输入的年、月、日
            const endDate = new Date(inputYear, inputMonth - 1, inputDay); // 同样注意月份从0开始计数
            // 计算两个日期之间的毫秒差
            const diffInMilliseconds = endDate - startDate;
            // 将毫秒差转换为天数
            const diffInDays = diffInMilliseconds / (1000 * 60 * 60 * 24);
            return Math.round(diffInDays);
        }